[
  {
    "id": 1,
    "name": "Dell OptiPlex 7090",
    "brand": "Dell",
    "category": "Office PCs",
    "price": 2800.0,
    "discount": 0.1,
    "image": "img/dell-dell-optiplex-7090.png",
    "images": ["img/dell-dell-optiplex-7090.png", "img/dell-dell-optiplex-7090.png", "img/dell-dell-optiplex-7090.png"],
    "description": "Dell OptiPlex 7090 Micro Form Factor Desktop is the perfect solution for modern business environments. Powered by the 11th Generation Intel Core i5-11500T processor with 6 cores and 12 threads, delivering exceptional performance for multitasking and demanding applications. Features 8GB DDR4-3200 RAM (expandable up to 64GB) and a lightning-fast 256GB PCIe NVMe SSD for instant boot times and application loading. The integrated Intel UHD Graphics 750 handles everyday visual tasks with ease. Connectivity options include USB 3.2 Gen 1 and Gen 2 ports, HDMI 1.4, DisplayPort 1.4, Gigabit Ethernet, WiFi 6, and Bluetooth 5.1. The ultra-compact design (178.5 x 182.0 x 34.2 mm) saves valuable desk space while maintaining powerful performance. Pre-installed with Windows 11 Pro for enhanced security and productivity features. Dell's comprehensive support and 3-year warranty ensure reliable business operation. Energy Star certified for reduced power consumption and environmental impact."
  },
  {
    "id": 2,
    "name": "ASUS ROG Strix G35DX",
    "brand": "ASUS",
    "category": "Gaming PCs",
    "price": 7800.0,
    "discount": 0.12,
    "image": "img/asus-asus-rog-strix-g35dx.png",
    "images": ["img/asus-asus-rog-strix-g35dx.png", "img/asus-asus-rog-strix-g35dx.png", "img/asus-asus-rog-strix-g35dx.png"],
    "description": "ASUS ROG Strix G35DX Gaming Desktop delivers uncompromising gaming performance with cutting-edge hardware and striking aesthetics. At its heart lies the AMD Ryzen 7 5700G processor, featuring 8 cores and 16 threads with base clock of 3.8GHz and boost up to 4.6GHz, ensuring smooth gameplay and content creation. The NVIDIA GeForce RTX 3060 Ti graphics card with 8GB GDDR6 memory provides exceptional 1440p gaming performance with ray tracing capabilities and DLSS technology for enhanced visual fidelity and frame rates. Equipped with 16GB DDR4-3200 RAM (dual-channel, expandable to 64GB) and a spacious 1TB PCIe 3.0 NVMe SSD for rapid game loading and ample storage. The innovative cooling system features ROG Keystone II with liquid cooling for the CPU and optimized airflow design to maintain peak performance under heavy loads. Aura Sync RGB lighting throughout the chassis creates a customizable gaming atmosphere. Connectivity includes USB 3.2 Gen 2, USB-C, HDMI 2.1, DisplayPort 1.4, Gigabit Ethernet, WiFi 6, and Bluetooth 5.2. Pre-built with Windows 11 Home and includes ROG gaming software suite for system optimization and RGB control. The tool-less upgrade design allows easy component upgrades for future-proofing your gaming setup."
  },
  {
    "id": 3,
    "name": "MacBook Pro 16-inch M3 Pro",
    "brand": "Apple",
    "category": "Laptops",
    "price": 9200.0,
    "discount": 0.08,
    "image": "img/apple-macbook-pro-16-inch-m3-pro.png",
    "description": "MacBook Pro 16-inch with M3 Pro chip represents the pinnacle of professional laptop performance, designed for demanding creative workflows and intensive computing tasks. The revolutionary M3 Pro chip features a 12-core CPU (6 performance and 6 efficiency cores) and 18-core GPU, delivering up to 40% faster performance than M1 Pro while maintaining exceptional energy efficiency. The unified memory architecture with 18GB provides seamless data flow between CPU, GPU, and Neural Engine. Storage is handled by a blazing-fast 1TB SSD with sequential read speeds up to 7.4GB/s. The stunning 16.2-inch Liquid Retina XDR display features 3456 x 2234 resolution, 1000 nits sustained brightness, 1600 nits peak HDR brightness, P3 wide color gamut, and ProMotion technology with adaptive refresh rates up to 120Hz for incredibly smooth scrolling and responsiveness. The advanced thermal system with improved heat dissipation allows sustained high performance without throttling. Professional connectivity includes three Thunderbolt 4 ports, HDMI 2.1, SDXC card slot, and MagSafe 3 charging. The backlit Magic Keyboard with Touch ID provides secure authentication and comfortable typing. Six-speaker sound system with force-canceling woofers delivers exceptional audio quality. All-day battery life up to 22 hours of video playback. Pre-installed with macOS Sonoma, optimized for professional applications like Final Cut Pro, Logic Pro, Xcode, and Adobe Creative Suite. The Space Black aluminum unibody construction ensures durability while maintaining the sleek, professional aesthetic Apple is renowned for."
  },
  {
    "id": 4,
    "name": "LG UltraWide 34WP65C-B",
    "brand": "LG",
    "category": "Monitors",
    "price": 1800.0,
    "discount": 0.15,
    "image": "img/lg-lg-ultrawide-34wp65c-b.png",
    "description": "LG UltraWide 34WP65C-B is a premium 34-inch curved ultrawide monitor that revolutionizes productivity and gaming experiences. The expansive 21:9 aspect ratio with 3440 x 1440 WQHD resolution provides 34% more workspace than traditional 27-inch QHD monitors, perfect for multitasking, video editing, and immersive gaming. The 1800R curvature matches the natural curve of human vision, reducing eye strain during extended use while creating an enveloping viewing experience. VA panel technology delivers deep blacks with 3000:1 contrast ratio and vivid colors covering 99% sRGB color space for accurate color reproduction. The impressive 160Hz refresh rate combined with 1ms MBR (Motion Blur Reduction) response time ensures ultra-smooth motion handling, making it ideal for fast-paced gaming and professional video work. AMD FreeSync Premium Pro and NVIDIA G-SYNC compatibility eliminate screen tearing and stuttering for seamless gameplay. HDR10 support with VESA DisplayHDR 400 certification enhances dynamic range for more realistic visuals. Comprehensive connectivity includes USB-C with 65W power delivery for single-cable laptop connection, two HDMI 2.0, DisplayPort 1.4, and USB 3.0 hub functionality. The ergonomic stand offers height, tilt, and swivel adjustments for optimal viewing comfort. OnScreen Control software allows easy monitor management directly from your computer. Built-in dual 7W speakers provide decent audio without requiring external speakers. The sleek, three-side borderless design maximizes screen real estate while maintaining a modern aesthetic that complements any workspace or gaming setup."
  },
  {
    "id": 5,
    "name": "Sony WH-1000XM5 Wireless Headphones",
    "brand": "Sony",
    "category": "Headphones",
    "price": 1200.0,
    "discount": 0.05,
    "image": "img/sony-sony-wh-1000xm5-wireless-headphones.png",
    "description": "Sony WH-1000XM5 Wireless Noise Canceling Headphones represent the pinnacle of audio engineering, featuring industry-leading noise cancellation technology and exceptional sound quality. The revolutionary V1 processor and dual noise sensor technology work together to deliver unprecedented noise canceling performance, automatically adapting to your environment whether you're on a plane, in a busy office, or walking on city streets. The newly developed 30mm carbon fiber composite drivers produce incredibly clear, detailed sound with deep bass response and crystal-clear highs across the entire frequency spectrum. DSEE Extreme technology powered by AI upscales compressed digital music files in real-time, restoring lost high-frequency elements for a more authentic listening experience. Hi-Res Audio and Hi-Res Audio Wireless support ensure you hear every detail as the artist intended. The innovative lightweight design features a complete redesign with a new soft fit leather headband and comfortable ear pads that distribute weight evenly for extended listening sessions up to 30 hours on a single charge. Quick Charge functionality provides 3 hours of playback with just 3 minutes of charging. Multipoint connection allows simultaneous pairing with two Bluetooth devices for seamless switching between phone calls and music. Speak-to-Chat technology automatically pauses music and lets in ambient sound when you start speaking. Precise Voice Pickup technology with advanced audio signal processing ensures crystal-clear hands-free calling even in noisy environments. Touch sensor controls on the right ear cup provide intuitive playback control, while wearing detection automatically pauses music when removed. 360 Reality Audio creates an immersive three-dimensional listening experience. The Sony Headphones Connect app allows complete customization of sound profiles, noise canceling levels, and adaptive sound control that learns your behavior and adjusts settings automatically."
  },
  {
    "id": 6,
    "name": "Secretlab TITAN Evo 2022",
    "brand": "Secretlab",
    "category": "Gaming Chairs",
    "price": 1600.0,
    "discount": 0.05,
    "image": "img/secretlab-secretlab-titan-evo-2022.png",
    "description": "Secretlab TITAN Evo 2022 Gaming Chair sets the gold standard for gaming and office seating, combining ergonomic excellence with premium materials and innovative design. The chair features Secretlab's proprietary cold-cure foam mix, a unique blend that provides optimal support while maintaining its shape and firmness even after years of use. The enhanced lumbar support system with the new integrated 4-way adjustable lumbar support precisely targets the natural curve of your spine, reducing fatigue during extended gaming or work sessions. The signature NEO Hybrid Leatherette upholstery offers superior durability, easy maintenance, and luxurious comfort while being more breathable than traditional leather. The full-length backrest provides comprehensive support from your shoulders to your lower back, while the improved seat base design distributes weight evenly to reduce pressure points. The chair's 4-way adjustable armrests (height, angle, depth, and pivot) can be precisely positioned to support any gaming style or work posture. The class-4 gas lift cylinder supports up to 180kg weight capacity while providing smooth height adjustment. The aluminum wheelbase with upgraded casters ensures smooth rolling on any floor surface without marking. The multi-tilt mechanism allows for reclining from 85° to 165° with infinite locking positions for the perfect angle whether gaming, working, or resting. The magnetic head pillow with memory foam core automatically finds the ideal position for neck support. Available in multiple color schemes and sizes (Regular, Small, XL) to accommodate different body types. Each chair comes with a 5-year extended warranty covering mechanical parts and a 3-year warranty on upholstery, demonstrating Secretlab's confidence in their build quality."
  },
  {
    "id": 7,
    "name": "Corsair RM850x 80 PLUS Gold",
    "brand": "Corsair",
    "category": "Power Supplies",
    "price": 450.0,
    "discount": 0.05,
    "image": "img/corsair-corsair-rm850x-80-plus-gold.png",
    "description": "Corsair RM850x 850W 80 PLUS Gold Certified Fully Modular Power Supply delivers exceptional efficiency, reliability, and quiet operation for high-performance gaming and workstation builds. The 80 PLUS Gold certification ensures minimum 87% efficiency at 20% load, 90% at 50% load, and 87% at 100% load, reducing electricity costs and heat generation. The fully modular cable system allows connection of only necessary cables, improving airflow and reducing cable clutter for cleaner builds. Premium Japanese 105°C-rated capacitors ensure long-term reliability and stable power delivery even under extreme conditions. The advanced Zero RPM fan mode keeps the 135mm magnetic levitation bearing fan completely silent during low to medium loads (up to ~300W), only spinning up when thermal conditions require active cooling. When active, the fan operates whisper-quiet with optimized fan curves for minimal noise. The single +12V rail design with 70.8A current capacity provides clean, stable power for modern high-end graphics cards and processors. Comprehensive protection features include Over Voltage Protection (OVP), Under Voltage Protection (UVP), Over Current Protection (OCP), Over Power Protection (OPP), Short Circuit Protection (SCP), and Over Temperature Protection (OTP). The flat, ribbon-style modular cables reduce airflow restriction while the black sleeved cables maintain a premium appearance. Universal AC input automatically works with global voltage standards (100-240V). The compact 150mm depth fits most modern cases while the ATX form factor ensures broad compatibility. Corsair backs this unit with a comprehensive 10-year warranty, demonstrating their confidence in build quality and reliability. RoHS compliant and meets strict safety certifications including UL, CE, TUV, CCC, and FCC standards."
  },
  {
    "id": 8,
    "name": "Noctua NH-D15 Premium CPU Cooler",
    "brand": "Noctua",
    "category": "CPU Coolers",
    "price": 380.0,
    "discount": 0.05,
    "image": "img/noctua-noctua-nh-d15-premium-cpu-cooler.png",
    "description": "Noctua NH-D15 Premium CPU Cooler represents the pinnacle of air cooling technology, delivering flagship-level thermal performance with whisper-quiet operation. The dual-tower design with six heat pipes and two premium-grade 140mm NF-A15 PWM fans provides exceptional cooling capacity equivalent to many high-end liquid cooling solutions. The massive aluminum fin stacks with optimized fin spacing maximize heat dissipation while maintaining excellent RAM compatibility through the asymmetrical design that provides extra clearance for tall memory modules. The mirror-finished nickel-plated copper base plate ensures optimal heat transfer from the CPU to the heat pipes. The heat pipes use advanced sintered powder wick structure and are filled with distilled water and special additives for superior thermal conductivity. The included NF-A15 PWM fans feature Noctua's advanced aerodynamic design with focused flow frame technology, stepped inlet design, and AAO (Advanced Acoustic Optimization) for maximum airflow with minimal noise. The fans operate at 300-1500 RPM with Low-Noise Adapters included to reduce speed to 1200 RPM for ultra-quiet operation. The SecuFirm2+ mounting system provides easy, safe installation on Intel (LGA1700, LGA1200, LGA115x, LGA20xx) and AMD (AM5, AM4, AM3(+), AM2(+), FM1, FM2(+)) sockets. The cooler includes NT-H1 thermal compound, known for its excellent thermal conductivity and long-term stability. The asymmetrical layout provides 64mm clearance for standard height RAM in the first slot and unlimited clearance in the second slot. The NH-D15 maintains CPU temperatures well below thermal limits even during intensive workloads while operating at near-silent noise levels. Noctua's legendary build quality is backed by a 6-year manufacturer's warranty and free SecuFirm2+ mounting kit upgrades for future socket generations."
  },
  {
    "id": 9,
    "name": "NVIDIA GeForce RTX 4070 Ti SUPER",
    "brand": "NVIDIA",
    "category": "Graphics Cards",
    "price": 3200.0,
    "discount": 0.05,
    "image": "img/nvidia-nvidia-geforce-rtx-4070-ti-super.png",
    "description": "NVIDIA GeForce RTX 4070 Ti SUPER Graphics Card delivers exceptional 1440p gaming performance and competitive 4K capabilities powered by the revolutionary Ada Lovelace architecture. Built on TSMC's 4nm process node, this powerhouse features 8,448 CUDA cores, 264 Tensor cores for AI acceleration, and 66 RT cores for realistic ray tracing effects. The 16GB GDDR6X memory with 256-bit memory bus provides 672.1 GB/s of bandwidth, ensuring smooth performance in memory-intensive games and applications. The base clock of 2340 MHz and boost clock up to 2610 MHz deliver consistent high frame rates across demanding titles. DLSS 3 with Frame Generation technology can increase frame rates up to 4x by generating intermediate frames using AI, enabling high-refresh gaming even with ray tracing enabled. Hardware-accelerated ray tracing creates photorealistic lighting, reflections, and shadows that bring virtual worlds to life. The advanced streaming multiprocessors deliver up to 2.8x better power efficiency compared to previous generation cards. AV1 encoding support enables efficient content creation and streaming with superior quality at lower bitrates. The dual media engines support simultaneous encode/decode operations for content creators and streamers. PCIe 4.0 interface ensures maximum bandwidth compatibility with modern motherboards. Advanced cooling solutions from board partners feature triple-fan designs, robust heatsinks, and optimized thermal interfaces to maintain peak performance while operating quietly. Support for up to four simultaneous displays enables expansive multi-monitor setups. NVIDIA Studio drivers provide optimal performance and reliability for creative applications including Blender, Adobe Creative Suite, and DaVinci Resolve. The card includes comprehensive software suite with GeForce Experience for driver updates, game optimization, and gameplay recording. Three-year manufacturer warranty ensures long-term reliability for this premium graphics solution."
  },
  {
    "id": 10,
    "name": "ASUS ROG Strix Z790-E Gaming WiFi",
    "brand": "ASUS",
    "category": "Motherboards",
    "price": 1800.0,
    "discount": 0.05,
    "image": "img/asus-asus-rog-strix-z790-e-gaming-wifi.png",
    "description": "ASUS ROG Strix Z790-E Gaming WiFi Motherboard represents the pinnacle of Intel Z790 platform engineering, designed to unleash the full potential of 12th and 13th generation Intel Core processors. The robust 16+1 power stage design with premium components including ProCool power connectors, high-quality capacitors, and military-grade TUF components ensures stable power delivery for extreme overclocking scenarios. Support for DDR5 memory up to 7200 MHz (overclocked) with four DIMM slots accommodating up to 128GB provides future-proof performance for demanding applications. Five PCIe slots including PCIe 5.0 x16 and PCIe 4.0 x16 (x8 mode) support multiple high-end graphics cards and expansion cards. Four M.2 slots with individual heatsinks support the latest PCIe 4.0 SSDs for lightning-fast storage performance, while SATA 6Gb/s ports provide additional storage expansion. Intel WiFi 6E provides ultra-fast wireless connectivity with 6GHz band support, while Bluetooth 5.3 ensures reliable peripheral connections. The 2.5Gb Ethernet port powered by Realtek RTL8125B controller delivers low-latency network performance for competitive gaming. SupremeFX audio solution with Sabre9018Q2C DAC, dedicated amplifiers, and audio shielding provides exceptional audio quality for immersive gaming and content creation. Comprehensive USB connectivity includes USB 3.2 Gen 2x2 Type-C, multiple USB 3.2 Gen 2 Type-A ports, and front-panel USB-C header for modern case compatibility. ASUS OptiMem II memory layout optimization and T-Topology design ensure maximum memory stability and performance. The advanced cooling solution features multiple fan headers with PWM/DC control, dedicated AIO pump headers, and comprehensive thermal sensors for optimal temperature management. Aura Sync RGB lighting with multiple headers allows complete lighting customization across your entire system. ROG-exclusive features including AI Overclocking, AI Cooling, and ASUS UEFI BIOS with EZ mode simplify system optimization and monitoring."
  },
  {
    "id": 11,
    "name": "Intel Core i7-13700K Processor",
    "brand": "Intel",
    "category": "Processors",
    "price": 1500.0,
    "discount": 0.05,
    "image": "img/intel-intel-core-i7-13700k-processor.png",
    "description": "Intel Core i7-13700K Processor delivers flagship performance with groundbreaking hybrid architecture combining high-performance P-cores and efficient E-cores for exceptional multitasking capabilities. The 13th generation Raptor Lake architecture features 8 Performance cores running at 3.4 GHz base clock (up to 5.4 GHz with Turbo Boost Max Technology 3.0) and 8 Efficient cores at 2.5 GHz base (up to 4.2 GHz boost) for a total of 16 cores and 24 threads. This configuration provides up to 15% better single-threaded performance and 41% better multi-threaded performance compared to the previous generation. The 30MB Intel Smart Cache (24MB L3 + 6MB L2) ensures rapid data access for demanding applications. Built on Intel's refined 10nm SuperFin process technology, the processor supports both DDR5-5600 and DDR4-3200 memory for flexible system configurations. PCIe 5.0 and PCIe 4.0 support enables next-generation graphics cards and storage devices to operate at maximum performance. Intel Thread Director technology intelligently assigns workloads to the appropriate cores, optimizing performance while maximizing efficiency. Integrated Intel UHD Graphics 770 provides excellent performance for everyday computing tasks and light gaming scenarios. The unlocked multiplier allows for extensive overclocking capabilities when paired with compatible motherboards and cooling solutions. Intel Thermal Velocity Boost automatically increases clock speeds when thermal conditions allow, extracting maximum performance from the silicon. Support for Intel's advanced instruction sets including AVX-512 accelerates specialized workloads in content creation, scientific computing, and artificial intelligence applications. The processor includes hardware-level security features such as Intel CET (Control-flow Enforcement Technology) and Intel TXT (Trusted Execution Technology) for enhanced system protection. Compatible with Intel 600 and 700 series chipset motherboards with LGA1700 socket. The K-series designation indicates this processor lacks integrated thermal solution, allowing enthusiasts to choose their preferred cooling method for optimal thermal performance and overclocking potential."
  },
  {
    "id": 12,
    "name": "Klipsch R-51PM Powered Bookshelf Speakers",
    "brand": "Klipsch",
    "category": "Speakers",
    "price": 980.0,
    "discount": 0.05,
    "image": "img/klipsch-klipsch-r-51pm-powered-bookshelf-speakers.png",
    "description": "Klipsch R-51PM Powered Bookshelf Speakers deliver legendary Klipsch sound quality with modern connectivity and built-in amplification, perfect for desktop setups, home offices, or compact listening rooms. The proprietary 1-inch aluminum LTS (Linear Travel Suspension) tweeter paired with Klipsch's signature 90° x 90° Tractrix Horn provides crystal-clear highs with controlled directivity and reduced distortion. The 5.25-inch copper-spun IMG (Injection Molded Graphite) woofer delivers deep, impactful bass response down to 62 Hz while maintaining excellent midrange clarity. Each speaker houses a dedicated amplifier - 35 watts RMS for the LF driver and 15 watts RMS for the HF driver - totaling 50 watts per channel of clean, dynamic power. The MDF cabinet construction with internal bracing eliminates unwanted resonances while the front-firing port design allows flexible placement near walls without compromising bass response. Comprehensive connectivity includes Bluetooth 5.0 wireless for streaming from smartphones and tablets, phono input for turntables with built-in RIAA preamp, line input for analog sources, and USB digital input for direct computer connection with 24-bit/192kHz capability. The integrated DAC ensures pristine digital-to-analog conversion for USB sources. Convenient front-panel controls include power, source selection, and volume adjustment, while the included remote control provides complete system control from your listening position. The removable magnetic grilles reveal the classic Klipsch copper woofer aesthetic. Premium binding post speaker terminals on the primary speaker accept high-quality speaker cables for connecting the passive secondary speaker. The speakers feature automatic standby mode to conserve energy when no signal is detected, and LED indicators show current operating status. Klipsch's legendary efficiency means these speakers produce room-filling sound with minimal power consumption while maintaining the dynamic, live sound signature that has made Klipsch a preferred choice of professional audio engineers and music enthusiasts for over 75 years."
  },
  {
    "id": 13,
    "name": "HP EliteDesk 800 G9 Mini Desktop",
    "brand": "HP",
    "category": "Office PCs",
    "price": 3200.0,
    "discount": 0.05,
    "image": "img/hp-hp-elitedesk-800-g9-mini-desktop.png",
    "description": "HP EliteDesk 800 G9 Mini Desktop redefines business computing with enterprise-grade performance in an ultra-compact form factor measuring just 177 x 175 x 34.2 mm. Powered by the 12th Generation Intel Core i7-12700 processor featuring 12 cores (8 Performance + 4 Efficient) and 20 threads, delivering exceptional multitasking performance for demanding business applications while maintaining energy efficiency. The processor's hybrid architecture automatically optimizes performance and power consumption based on workload requirements. Equipped with 16GB DDR5-4800 SO-DIMM memory (expandable to 64GB) providing faster data access and improved responsiveness for memory-intensive applications. The 512GB PCIe NVMe SSD ensures lightning-fast boot times, rapid application loading, and responsive system performance while offering ample storage for business documents and applications. Intel UHD Graphics 770 provides excellent display capabilities supporting up to three 4K displays simultaneously through DisplayPort 1.4 and USB-C connections. Comprehensive security features include HP Sure Start Gen7 BIOS protection, HP Sure Sense malware detection, HP Sure Click browser isolation, TPM 2.0 security chip, and optional fingerprint reader for multi-factor authentication. The innovative tool-free chassis design allows easy access to internal components for upgrades and maintenance. Extensive connectivity includes four USB 3.2 Gen 2 Type-A ports, two USB-C ports (one supporting power delivery), DisplayPort 1.4, VGA port, audio combo jack, and Gigabit Ethernet. Integrated Intel WiFi 6E AX211 provides ultra-fast wireless connectivity with 6GHz band support, while Bluetooth 5.3 ensures reliable peripheral connections. The optional VESA mounting bracket allows secure mounting behind monitors for space-saving installations. ENERGY STAR certified and EPEAT Gold registered for environmental sustainability. Pre-installed with Windows 11 Pro providing enhanced security features, device management capabilities, and productivity tools. HP's commercial-grade build quality is backed by a comprehensive 3-year warranty with optional extended service plans and HP's global support network."
  },
  {
    "id": 14,
    "name": "Samsung Odyssey G7 32-inch Curved Gaming Monitor",
    "brand": "Samsung",
    "category": "Monitors",
    "price": 2400.0,
    "discount": 0.05,
    "image": "img/samsung-samsung-odyssey-g7-32-inch-curved-gaming-monitor.png",
    "description": "Samsung Odyssey G7 32-inch Curved Gaming Monitor delivers immersive gaming experiences with cutting-edge display technology and competitive-grade performance specifications. The massive 32-inch WQHD (2560 x 1440) VA panel provides 77% more screen real estate than 1080p displays while maintaining crisp pixel density for detailed visuals. The aggressive 1000R curvature matches the natural curve of the human eye, creating an enveloping viewing experience that draws you into the action while reducing peripheral distraction. The blazing-fast 240Hz refresh rate ensures ultra-smooth motion handling, making it ideal for competitive esports titles where every frame matters. The exceptional 1ms MPRT (Moving Picture Response Time) virtually eliminates motion blur and ghosting for crystal-clear tracking of fast-moving objects. NVIDIA G-SYNC Compatible and AMD FreeSync Premium Pro certifications eliminate screen tearing and stuttering across the entire refresh rate range for seamless gameplay. The Quantum Dot technology delivers 125% sRGB color coverage with vibrant, accurate colors that bring games to life. HDR600 certification with local dimming provides enhanced contrast with deeper blacks and brighter highlights for more realistic visuals in supported content. The Eye Saver Mode and Flicker Free technology reduce eye strain during extended gaming sessions. Multiple picture modes including FPS, RTS, RPG, and AOS optimize display settings for different game genres. The sleek design features a three-side borderless display with core lighting that creates an immersive ambient atmosphere. The fully adjustable stand offers height, tilt, swivel, and pivot adjustments for optimal ergonomic positioning. Comprehensive connectivity includes DisplayPort 1.4, dual HDMI 2.0 ports, and USB 3.0 hub functionality for peripheral connections. Samsung's Game Bar provides easy access to key gaming features and system monitoring without leaving your game. The monitor includes Picture-by-Picture and Picture-in-Picture modes for enhanced multitasking capabilities."
  },
  {
    "id": 15,
    "name": "MSI Aegis RS 13 Gaming Desktop",
    "brand": "MSI",
    "category": "Gaming PCs",
    "price": 8500.0,
    "discount": 0.05,
    "image": "img/msi-msi-aegis-rs-13-gaming-desktop.png",
    "description": "MSI Aegis RS 13 Gaming Desktop combines flagship gaming performance with striking aesthetics and premium build quality for the ultimate gaming experience. At its core lies the powerful Intel Core i7-13700KF processor with 16 cores (8P+8E) and 24 threads, delivering exceptional gaming performance and content creation capabilities with base clocks of 3.4GHz and boost frequencies up to 5.4GHz. The unlocked K-series processor provides extensive overclocking potential for enthusiasts seeking maximum performance. Paired with the formidable NVIDIA GeForce RTX 4060 Ti graphics card featuring 16GB GDDR6 memory, this system delivers excellent 1440p gaming performance with ray tracing and DLSS 3 support for enhanced visual fidelity and frame rates. The massive 32GB DDR5-4800 dual-channel memory configuration ensures smooth multitasking and future-proof performance for demanding games and applications. Storage needs are met with a lightning-fast 1TB PCIe 4.0 NVMe SSD providing rapid boot times, quick game loading, and responsive system performance. The advanced MSI Cooling System features liquid cooling for the CPU with a 240mm radiator and optimized case airflow with multiple intake and exhaust fans to maintain optimal temperatures under heavy gaming loads. The tempered glass side panel showcases the internal components while Mystic Light RGB lighting throughout the system creates a customizable gaming atmosphere with synchronized lighting effects. The premium MSI Gaming motherboard provides robust power delivery, multiple expansion slots, and comprehensive connectivity options. I/O includes multiple USB 3.2 ports, USB-C, HDMI, DisplayPort, Gigabit Ethernet, and high-definition audio outputs. WiFi 6E wireless connectivity ensures low-latency online gaming, while Bluetooth 5.3 provides reliable peripheral connections. The system comes pre-installed with Windows 11 Home and MSI's exclusive gaming software suite including MSI Center for system monitoring and optimization, Dragon Center for RGB control, and Nahimic audio enhancement. The tool-free upgrade design allows easy component upgrades for future expansion. MSI's build quality is backed by comprehensive warranty coverage and technical support, making this system an excellent choice for serious gamers and content creators demanding top-tier performance."
  }
]